src/Catalogs/ВнешниеЦКК/ВнешниеЦКК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВнешниеЦКК</name>
  <attributes>
    <name>WSСсылкаInputStatisticsDate</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипВнешнегоЦКК</name>
    <type>
      <types>EnumRef.ТипыВнешнихЦКК</types>
    </type>
  </attributes>
  <attributes>
    <name>УИДПользователя</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭкспортСчетчиков</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВнешниеЦКК</name>
    <attributes>
      <name>ПередаватьДанные</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВнешнийЦКК</name>
      <type>
        <types>CatalogRef.ВнешниеЦКК</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Enums/ТипыВнешнихЦКК/ТипыВнешнихЦКК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыВнешнихЦКК</name>
  <enumValues>
    <name>Главные</name>
  </enumValues>
  <enumValues>
    <name>Подчиненные</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/ВнешниеЦКК/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.ТипВнешнегоЦКК = Перечисления.ТипыВнешнихЦКК.Главные Тогда
		ЭтотОбъект.Элементы.Пользователь.Заголовок = "Пользователь подключения к внешнему ЦКК";
		ЭтотОбъект.Элементы.WSСсылкаInputStatisticsDate.Видимость = Истина;
		ЭтотОбъект.Элементы.СтраницаЭкспорт.Видимость = Ложь;
		ЭтотОбъект.Элементы.СтраницыПараметры.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
		ЭтотОбъект.Элементы.ОбновитьПароль.Видимость = Ложь;
		ЭтотОбъект.Элементы.ДекорацияПояснение.Видимость = Ложь;
	ИначеЕсли Объект.ТипВнешнегоЦКК = Перечисления.ТипыВнешнихЦКК.Подчиненные Тогда
		ЭтотОбъект.Элементы.Пользователь.Заголовок = "Пользователь подключения к текущему ЦКК";
		ЭтотОбъект.Элементы.WSСсылкаInputStatisticsDate.Видимость = Ложь;
		ЭтотОбъект.Элементы.СтраницаЭкспорт.Видимость = Истина;
		ЭтотОбъект.Элементы.СтраницыПараметры.ОтображениеСтраниц = ОтображениеСтраницФормы.ЗакладкиСверху;
		ЭтотОбъект.Элементы.ОбновитьПароль.Видимость = Истина;
		ЭтотОбъект.Элементы.ДекорацияПояснение.Видимость = Истина;
		ЭтотОбъект.Элементы.СтраницаЭкспорт.Видимость = Константы.ОтправлятьДанныеВнешнимЦКК.Получить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТипВнешнегоЦККПриИзменении(Элемент)
	Если Объект.ТипВнешнегоЦКК = ПредопределенноеЗначение("Перечисление.ТипыВнешнихЦКК.Главные") Тогда
		ЭтотОбъект.Элементы.Пользователь.Заголовок = "Пользователь подключения к внешнему ЦКК";
		ЭтотОбъект.Элементы.WSСсылкаInputStatisticsDate.Видимость = Истина;
		ЭтотОбъект.Элементы.СтраницаЭкспорт.Видимость = Ложь;
		ЭтотОбъект.Элементы.СтраницыПараметры.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
		ЭтотОбъект.Элементы.ОбновитьПароль.Видимость = Ложь;
		ЭтотОбъект.Элементы.ДекорацияПояснение.Видимость = Ложь;
	ИначеЕсли Объект.ТипВнешнегоЦКК = ПредопределенноеЗначение("Перечисление.ТипыВнешнихЦКК.Подчиненные") Тогда
		ЭтотОбъект.Элементы.Пользователь.Заголовок = "Пользователь подключения к текущему ЦКК";
		ЭтотОбъект.Элементы.WSСсылкаInputStatisticsDate.Видимость = Ложь;
		ЭтотОбъект.Элементы.СтраницаЭкспорт.Видимость = Истина;
		ЭтотОбъект.Элементы.СтраницыПараметры.ОтображениеСтраниц = ОтображениеСтраницФормы.ЗакладкиСверху;
		
		Если НЕ ЗначениеЗаполнено(Объект.Пользователь) Тогда
			Объект.Пользователь = "QMC_" + ПолучитьНовыйНомерПодчиненногоЦКК();
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Объект.Пароль) Тогда
			Объект.Пароль = СгенерироватьПароль(10);
		КонецЕсли;
		
		ЭтотОбъект.Элементы.ОбновитьПароль.Видимость = Истина;
		ЭтотОбъект.Элементы.ДекорацияПояснение.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНовыйНомерПодчиненногоЦКК()
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(СправочникВнешниеЦКК.Ссылка) КАК Количество
	|ИЗ
	|	Справочник.ВнешниеЦКК КАК СправочникВнешниеЦКК
	|ГДЕ
	|	СправочникВнешниеЦКК.ТипВнешнегоЦКК = &ТипВнешнегоЦККПодчиненный
	|";
	
	Запрос.УстановитьПараметр("ТипВнешнегоЦККПодчиненный", Перечисления.ТипыВнешнихЦКК.Подчиненные);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат 1;
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Количество + 1;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ВнешниеЦККПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока И НЕ Копирование Тогда
		Элемент.ТекущиеДанные.ПередаватьДанные = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция СгенерироватьПароль(КоличествоСимволов)  Экспорт
	СтрокаПароля = "";
	ГСЧ = Новый ГенераторСлучайныхЧисел();
	ГСЧ_Индекс = Новый ГенераторСлучайныхЧисел(ГСЧ.СлучайноеЧисло(0,100));

	Для ТекИндекс = 1 по КоличествоСимволов Цикл
		ИндексПароля = ГСЧ_Индекс.СлучайноеЧисло(1,3);
		Если ИндексПароля = 1 Тогда
			 КодСимвола = ГСЧ.СлучайноеЧисло(97,122);
		ИначеЕсли ИндексПароля = 2 Тогда
			 КодСимвола =  ГСЧ.СлучайноеЧисло(48,57);
		ИначеЕсли ИндексПароля = 3 Тогда	 
			 КодСимвола =  ГСЧ.СлучайноеЧисло(65,90);
		КонецЕсли;
		СтрокаПароля = СтрокаПароля + Символ(КодСимвола);
	КонецЦикла;
	
	Возврат СтрокаПароля;	 
КонецФункции

&НаКлиенте
Процедура ПользовательПриИзменении(Элемент)
	Если НЕ ЗначениеЗаполнено(Объект.Пароль) И Объект.ТипВнешнегоЦКК = ПредопределенноеЗначение("Перечисление.ТипыВнешнихЦКК.Подчиненные") Тогда
		Объект.Пароль = СгенерироватьПароль(10);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПароль(Команда)
	Если Объект.ТипВнешнегоЦКК = ПредопределенноеЗначение("Перечисление.ТипыВнешнихЦКК.Подчиненные") Тогда
		Объект.Пароль = СгенерироватьПароль(10);
	КонецЕсли;
КонецПроцедуры
